In [1]:
import pandas as pd
import numpy as np

dataframe using dictionary

In [5]:

df=pd.DataFrame({
    "Name":["Prajakta","Amey","Monika"],
    "Age":[23,24,25],
    "Fav_colour": ["White","Black","Green"]
})

In [6]:
df

       Name  Age Fav_colour
0  Prajakta   23      White
1      Amey   24      Black
2    Monika   25      Green

In [8]:
df.index=range(1,len(df)+1)
df

       Name  Age Fav_colour
1  Prajakta   23      White
2      Amey   24      Black
3    Monika   25      Green

dataframe using list

In [88]:
data=(["prajakta",23,"white"],
     ["Amey",24,"Black"],
     ["Monika",25,"Green"])
columns=["Name","age","Colour"]
df=pd.DataFrame(data, columns=columns)
df.index=range(1,len(df)+1)
df

       Name  age Colour
1  prajakta   23  white
2      Amey   24  Black
3    Monika   25  Green

Creating a DataFrame from a CSV File

df=pd.read_csv(r "")
df=pd.read_excel(r "")

In [16]:
df.head()

       Name  age Colour
1  prajakta   23  white
2      Amey   24  Black
3    Monika   25  Green

In [17]:
df.tail(1)

     Name  age Colour
3  Monika   25  Green

In [18]:
df.info

<bound method DataFrame.info of        Name  age Colour
1  prajakta   23  white
2      Amey   24  Black
3    Monika   25  Green>

filter the data

In [23]:
df_f=df[df['age']>24]
df_f

     Name  age Colour
3  Monika   25  Green

add new colummn

In [27]:
df["senior"]=df["age"]>24

In [28]:
df

       Name  age Colour  senior
1  prajakta   23  white   False
2      Amey   24  Black   False
3    Monika   25  Green    True

update existing data

In [32]:
df.loc[df["Name"]=="prajakta", "age"]=34

In [33]:
df

       Name  age Colour  senior  Age
1  prajakta   34  white   False  NaN
2      Amey   24  Black   False  NaN
3    Monika   25  Green    True  NaN

In [36]:
df=df.drop(columns="Age",axis=1)

In [37]:
df

       Name  age Colour  senior
1  prajakta   34  white   False
2      Amey   24  Black   False
3    Monika   25  Green    True

    new column

In [39]:
df["city"]=["Pune","phaltan","dapoli"]

In [40]:
df

       Name  age Colour  senior     city
1  prajakta   34  white   False     Pune
2      Amey   24  Black   False  phaltan
3    Monika   25  Green    True   dapoli

In [44]:
df.loc[df["Name"]=="prajakta","city"]="dapoli"

In [45]:
df

       Name  age Colour  senior     city
1  prajakta   34  white   False   dapoli
2      Amey   24  Black   False  phaltan
3    Monika   25  Green    True   dapoli

group and aggregate

In [50]:
df_g=df.groupby("city")["age"].mean()

In [51]:
print(df_g)

city
dapoli     29.5
phaltan    24.0
Name: age, dtype: float64

sort data

In [54]:
df_s=df.sort_values(by=["age","Name"],ascending=[True,False])

In [55]:
df_s

       Name  age Colour  senior     city
2      Amey   24  Black   False  phaltan
3    Monika   25  Green    True   dapoli
1  prajakta   34  white   False   dapoli

In [56]:
df["school"]=["","","dapoli"]

In [57]:
df

       Name  age Colour  senior     city  school
1  prajakta   34  white   False   dapoli
2      Amey   24  Black   False  phaltan
3    Monika   25  Green    True   dapoli  dapoli

handle null values

In [69]:
# replace empty string with nan 
df["school"].replace("","NaN",inplace=True)

C:\Users\User\AppData\Local\Temp\ipykernel_20212\2409299838.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["school"].replace("","NaN",inplace=True)

In [1]:
df.replace({'': NaN}, inplace=True)

NameError: name 'df' is not defined

In [70]:
df["school"]=df["school"].fillna("unknown")

In [71]:
df

       Name  age Colour  senior     city   school
1  prajakta   34  white   False   dapoli  unknown
2      Amey   24  Black   False  phaltan  unknown
3    Monika   25  Green    True   dapoli   dapoli

Merge the datframes

In [73]:
df2=pd.DataFrame(
    {"Name":["prajakta","Amey","Monika"],
     "Occ":["Data Analyst","eng","Medical officer"]
    }
)

In [75]:
df2.index=range(1,len(df2)+1)

In [76]:
df2

       Name              Occ
1  prajakta     Data Analyst
2      Amey              eng
3    Monika  Medical officer

In [78]:
df2_m=pd.merge(df,df2, on="Name")

In [81]:
df2_m.index=range(1,len(df2_m)+1)

df2_m

In [87]:
df2_m.loc[df2_m["Name"]=="Amey","school"]="DND"

In [88]:
df2_m

       Name  age Colour  senior     city   school              Occ
1  prajakta   34  white   False   dapoli  unknown     Data Analyst
2      Amey   24  Black   False  phaltan      DND              eng
3    Monika   25  Green    True   dapoli   dapoli  Medical officer

save

In [100]:
df2_m.to_csv("sjdhbc.csv",index=False)

basic operations

In [104]:
df["Name"]  #--> single column

1    prajakta
2        Amey
3      Monika
Name: Name, dtype: object

In [105]:
df[["Name","age"]]   #--> multiple column

       Name  age
1  prajakta   34
2      Amey   24
3    Monika   25

In [106]:
df.iloc[1]   #--> row at index 1

Name         Amey
age            24
Colour      Black
senior      False
city      phaltan
school        DND
Name: 2, dtype: object

In [107]:
df.loc[1]     #--> row with lable 1

Name      prajakta
age             34
Colour       white
senior       False
city        dapoli
school     unknown
Name: 1, dtype: object

In [110]:
df

       Name  age Colour  senior     city   school
1  prajakta   34  white   False   dapoli  unknown
2      Amey   24  Black   False  phaltan      DND
3    Monika   25  Green    True   dapoli   dapoli

In [109]:
df.iloc[0:2,1:3]

   age Colour
1   34  white
2   24  Black

18/09/2024

In [40]:
from datetime import datetime
data = {
    'student_id': [101, 102, 103, 104, 105],
    'name': ['John Doe', 'Jane Smith', 'Tom Brown', 'Emily Davis', 'Michael Johnson'],
    'age': [20, 21, 19, 22, 23],
    'email': ['john@example.com', 'jane@example.com', 'tom@example.com', 'emily@example.com', 'michael@example.com'],
    'course': ['Physics', 'Mathematics', 'Computer Science', 'Engineering', 'Economics'],
    'grade': ['A', 'B', 'A', 'C', 'B'],
    'enrollment_date': [datetime(2021, 9, 1), datetime(2020, 9, 1), datetime(2021, 1, 1), datetime(2020, 1, 1), datetime(2019, 9, 1)]
}

In [41]:
df=pd.DataFrame(data)
df

,student_id,name,age,email,course,grade,enrollment_date
0,101,John Doe,20,john@example.com,Physics,A,2021-09-01
1,102,Jane Smith,21,jane@example.com,Mathematics,B,2020-09-01
2,103,Tom Brown,19,tom@example.com,Computer Science,A,2021-01-01
3,104,Emily Davis,22,emily@example.com,Engineering,C,2020-01-01
4,105,Michael Johnson,23,michael@example.com,Economics,B,2019-09-01

In [6]:
df.index=range(1,len(df)+1)
df

,student_id,name,age,email,course,grade,enrollment_date
1,101,John Doe,20,john@example.com,Physics,A,2021-09-01
2,102,Jane Smith,21,jane@example.com,Mathematics,B,2020-09-01
3,103,Tom Brown,19,tom@example.com,Computer Science,A,2021-01-01
4,104,Emily Davis,22,emily@example.com,Engineering,C,2020-01-01
5,105,Michael Johnson,23,michael@example.com,Economics,B,2019-09-01

In [7]:
# 1. Filter students with grade 'A'
x=df[df["grade"]=="A"]
x

,student_id,name,age,email,course,grade,enrollment_date
1,101,John Doe,20,john@example.com,Physics,A,2021-09-01
3,103,Tom Brown,19,tom@example.com,Computer Science,A,2021-01-01

In [8]:
# 2. Add a new column 'passed' (True if grade is 'A' or 'B', otherwise False)
df["passed"]=df["grade"].apply(lambda x: True if x in ["A","B"] else False)
df

,student_id,name,age,email,course,grade,enrollment_date,passed
1,101,John Doe,20,john@example.com,Physics,A,2021-09-01,True
2,102,Jane Smith,21,jane@example.com,Mathematics,B,2020-09-01,True
3,103,Tom Brown,19,tom@example.com,Computer Science,A,2021-01-01,True
4,104,Emily Davis,22,emily@example.com,Engineering,C,2020-01-01,False
5,105,Michael Johnson,23,michael@example.com,Economics,B,2019-09-01,True

In [10]:
# 3. Calculate the average age of the students.
avg_age=df["age"].mean()
avg_age

21.0

In [11]:
# 4. Sort the DataFrame by enrollment_date.
y=df.sort_values(by="enrollment_date")
y

,student_id,name,age,email,course,grade,enrollment_date,passed
5,105,Michael Johnson,23,michael@example.com,Economics,B,2019-09-01,True
4,104,Emily Davis,22,emily@example.com,Engineering,C,2020-01-01,False
2,102,Jane Smith,21,jane@example.com,Mathematics,B,2020-09-01,True
3,103,Tom Brown,19,tom@example.com,Computer Science,A,2021-01-01,True
1,101,John Doe,20,john@example.com,Physics,A,2021-09-01,True

In [12]:
df

,student_id,name,age,email,course,grade,enrollment_date,passed
1,101,John Doe,20,john@example.com,Physics,A,2021-09-01,True
2,102,Jane Smith,21,jane@example.com,Mathematics,B,2020-09-01,True
3,103,Tom Brown,19,tom@example.com,Computer Science,A,2021-01-01,True
4,104,Emily Davis,22,emily@example.com,Engineering,C,2020-01-01,False
5,105,Michael Johnson,23,michael@example.com,Economics,B,2019-09-01,True

In [13]:
# Count the Number of Students in Each Course
z=df["course"].value_counts()
z

course
Physics             1
Mathematics         1
Computer Science    1
Engineering         1
Economics           1
Name: count, dtype: int64

In [14]:
# Find Students Enrolled After a Specific Date.
date_filter= datetime(2020,9,1)
stude_after_date=df[df["enrollment_date"]> date_filter]
stude_after_date

,student_id,name,age,email,course,grade,enrollment_date,passed
1,101,John Doe,20,john@example.com,Physics,A,2021-09-01,True
3,103,Tom Brown,19,tom@example.com,Computer Science,A,2021-01-01,True

In [15]:
df

,student_id,name,age,email,course,grade,enrollment_date,passed
1,101,John Doe,20,john@example.com,Physics,A,2021-09-01,True
2,102,Jane Smith,21,jane@example.com,Mathematics,B,2020-09-01,True
3,103,Tom Brown,19,tom@example.com,Computer Science,A,2021-01-01,True
4,104,Emily Davis,22,emily@example.com,Engineering,C,2020-01-01,False
5,105,Michael Johnson,23,michael@example.com,Economics,B,2019-09-01,True

In [17]:
# Update Grades for a Student
df.loc[df["student_id"]==102, "grade"]="A"
df

,student_id,name,age,email,course,grade,enrollment_date,passed
1,101,John Doe,20,john@example.com,Physics,A,2021-09-01,True
2,102,Jane Smith,21,jane@example.com,Mathematics,A,2020-09-01,True
3,103,Tom Brown,19,tom@example.com,Computer Science,A,2021-01-01,True
4,104,Emily Davis,22,emily@example.com,Engineering,C,2020-01-01,False
5,105,Michael Johnson,23,michael@example.com,Economics,B,2019-09-01,True

In [18]:
# Update Grades for a Student
df=df[df["age"]>20]
df

,student_id,name,age,email,course,grade,enrollment_date,passed
2,102,Jane Smith,21,jane@example.com,Mathematics,A,2020-09-01,True
4,104,Emily Davis,22,emily@example.com,Engineering,C,2020-01-01,False
5,105,Michael Johnson,23,michael@example.com,Economics,B,2019-09-01,True

In [19]:
df

,student_id,name,age,email,course,grade,enrollment_date,passed
2,102,Jane Smith,21,jane@example.com,Mathematics,A,2020-09-01,True
4,104,Emily Davis,22,emily@example.com,Engineering,C,2020-01-01,False
5,105,Michael Johnson,23,michael@example.com,Economics,B,2019-09-01,True

In [22]:
# Group Students by Grade and Get Average Age.
avg_age_by_grade = df.groupby("grade")["age"].mean()
avg_age_by_grade

grade
A    19.5
B    22.0
C    22.0
Name: age, dtype: float64

In [23]:
# Check for Missing Data
df.isnull().sum()

student_id         0
name               0
age                0
email              0
course             0
grade              0
enrollment_date    0
dtype: int64

In [24]:
df.isna().sum()

student_id         0
name               0
age                0
email              0
course             0
grade              0
enrollment_date    0
dtype: int64

In [27]:
# Find the Youngest and Oldest Students.
youngest=df.loc[df["age"].idxmin()]
oldest=df.loc[df["age"].idxmax()]
youngest

student_id                         103
name                         Tom Brown
age                                 19
email                  tom@example.com
course                Computer Science
grade                                A
enrollment_date    2021-01-01 00:00:00
Name: 2, dtype: object

In [26]:
oldest

student_id                         105
name                   Michael Johnson
age                                 23
email              michael@example.com
course                       Economics
grade                                B
enrollment_date    2019-09-01 00:00:00
Name: 4, dtype: object

In [28]:
df

,student_id,name,age,email,course,grade,enrollment_date
0,101,John Doe,20,john@example.com,Physics,A,2021-09-01
1,102,Jane Smith,21,jane@example.com,Mathematics,B,2020-09-01
2,103,Tom Brown,19,tom@example.com,Computer Science,A,2021-01-01
3,104,Emily Davis,22,emily@example.com,Engineering,C,2020-01-01
4,105,Michael Johnson,23,michael@example.com,Economics,B,2019-09-01

In [29]:
df["remark"]=df["grade"].apply(lambda x: True if x in ["A","B"] else False)
df

,student_id,name,age,email,course,grade,enrollment_date,remark
0,101,John Doe,20,john@example.com,Physics,A,2021-09-01,True
1,102,Jane Smith,21,jane@example.com,Mathematics,B,2020-09-01,True
2,103,Tom Brown,19,tom@example.com,Computer Science,A,2021-01-01,True
3,104,Emily Davis,22,emily@example.com,Engineering,C,2020-01-01,False
4,105,Michael Johnson,23,michael@example.com,Economics,B,2019-09-01,True

In [30]:
df=df.drop(columns=["remark"],axis=1)
df

,student_id,name,age,email,course,grade,enrollment_date
0,101,John Doe,20,john@example.com,Physics,A,2021-09-01
1,102,Jane Smith,21,jane@example.com,Mathematics,B,2020-09-01
2,103,Tom Brown,19,tom@example.com,Computer Science,A,2021-01-01
3,104,Emily Davis,22,emily@example.com,Engineering,C,2020-01-01
4,105,Michael Johnson,23,michael@example.com,Economics,B,2019-09-01

In [32]:
pivot_table = pd.pivot_table(df, values='grade', index='course', aggfunc='count')
print("\nPivot table of grades by course and passed status:")
print(pivot_table)

Pivot table of grades by course and passed status:
                  grade
course
Computer Science      1
Economics             1
Engineering           1
Mathematics           1
Physics               1

In [42]:
# Change Column Name
df.rename(columns={"name":"stud_name"},inplace=True)
df

,student_id,stud_name,age,email,course,grade,enrollment_date
0,101,John Doe,20,john@example.com,Physics,A,2021-09-01
1,102,Jane Smith,21,jane@example.com,Mathematics,B,2020-09-01
2,103,Tom Brown,19,tom@example.com,Computer Science,A,2021-01-01
3,104,Emily Davis,22,emily@example.com,Engineering,C,2020-01-01
4,105,Michael Johnson,23,michael@example.com,Economics,B,2019-09-01

In [43]:
df.set_index("student_id", inplace=True)
df

,stud_name,age,email,course,grade,enrollment_date
student_id,,,,,,
101,John Doe,20,john@example.com,Physics,A,2021-09-01
102,Jane Smith,21,jane@example.com,Mathematics,B,2020-09-01
103,Tom Brown,19,tom@example.com,Computer Science,A,2021-01-01
104,Emily Davis,22,emily@example.com,Engineering,C,2020-01-01
105,Michael Johnson,23,michael@example.com,Economics,B,2019-09-01

In [45]:
df.loc[df["stud_name"]=="John Doe", "course"]="Data Science"
df

,stud_name,age,email,course,grade,enrollment_date
student_id,,,,,,
101,John Doe,20,john@example.com,Data Science,A,2021-09-01
102,Jane Smith,21,jane@example.com,Mathematics,B,2020-09-01
103,Tom Brown,19,tom@example.com,Computer Science,A,2021-01-01
104,Emily Davis,22,emily@example.com,Engineering,C,2020-01-01
105,Michael Johnson,23,michael@example.com,Economics,B,2019-09-01

In [46]:
df.loc[105, "course"]="M.B.B.S"
df

,stud_name,age,email,course,grade,enrollment_date
student_id,,,,,,
101,John Doe,20,john@example.com,Data Science,A,2021-09-01
102,Jane Smith,21,jane@example.com,Mathematics,B,2020-09-01
103,Tom Brown,19,tom@example.com,Computer Science,A,2021-01-01
104,Emily Davis,22,emily@example.com,Engineering,C,2020-01-01
105,Michael Johnson,23,michael@example.com,M.B.B.S,B,2019-09-01

In [47]:
even=df[df.index%2==0]
even

,stud_name,age,email,course,grade,enrollment_date
student_id,,,,,,
102,Jane Smith,21,jane@example.com,Mathematics,B,2020-09-01
104,Emily Davis,22,emily@example.com,Engineering,C,2020-01-01

In [49]:
df.shape[0]

5

In [51]:
def xrange(start, stop=None, step=1):
    # Handle if only one argument is provided
    if stop is None:
        stop = start
        start = 0
    
    current = start
    while current < stop:
        yield current
        current += step
for i in xrange(5):
    print(i)

0
1
2
3
4

In [53]:
# object orinted programming
class praj:
    def __init__(self, name, age):
        self.name=name
        self.age=age
    def show(self):
        print(f"my name is {self.name} and im {self.age} years old")

a=praj("jsdhbcg",78)
a.show()

my name is jsdhbcg and im 78 years old

In [64]:
# . Create a method in it to check if the give input satisfies a particular condition or not
# Create a object of the class and perfoem certain action with it
class xyz:
    def __init__(self,number):
        self.number=number
    def is_even(self):
        return f" is it even : {self.number % 2==0}"
    def is_positive(self):
        return f"is it positive : {self.number>0}"
    def satisfies_condition(self):
        a=self.is_even()
        b=self.is_positive()
        return a , b
a=xyz(18)
print(a.is_even())             
print(a.is_positive())          
print(a.satisfies_condition())

 is it even : True
is it positive : True
(' is it even : True', 'is it positive : True')

In [70]:
# 17. Given a list , find the missing value in this, after that asked to do more changes in it
l1=[1,2,3,5]
def missing_value(l1):
    n=len(l1)+1
    expexted_sum=n*(n+1)//2
    actual_sum=sum(l1)
    missing=expexted_sum-actual_sum
    return missing
a=missing_value(l1)
a

4

In [85]:
# insert that missing value in the list

l1=[1,2,3,5]
def missing_value(l1):
    n=len(l1)+1
    expexted_sum=n*(n+1)//2
    actual_sum=sum(l1)
    missing=expexted_sum - actual_sum
    return missing
a=missing_value(l1)
print("Missing  value is: "  ,a)

Missing  value is:  4

In [86]:
def insert_missing_value(l1,a):
    l1.append(a)
    return sorted(l1)
updated=insert_missing_value(l1,a)
updated

[1, 2, 3, 4, 5]

In [87]:
# Descending order
desc=sorted(list(set(updated)), reverse=True)
desc

[5, 4, 3, 2, 1]